// Цикл for

// for (ініціалазція; умова; пост - вираз) {
//     // тіло цикла
// }
// ініціалізації - постакове значення, в циклі зазвичай 0, 1 тощо/
// чому let бо воно буде збільшуватись на пене значення
// умова це по суті довжина циклу. вона зазвичай більше або менше певного числа 
// пост-вираз тут ми змінюємо цикл додаємо чи віднімаємо i = i + 1 теж саме що i += 1

// for (let i = 0; i < 5; i += 1) {
//     console.log(i);
// }

// console.log("тут можна закінчити в кінці");

// ===================================================================

// pre-increment і post-increment  ЗЛО некористуватись

// let a = 10;
// const b = ++a;

// console.log(a);
// console.log(b);

// ===================================================================
// Напиш скрипт який підрахує загальну сумму зарплати працівників 
// кілкьітсь працівників зберігаєтсья в перемінні employees
// Зарплата кожного працівника це випадкова цифра від 500 до 5000
// записати сумму в перемінну totalSalary і виввести в консоль

// 1. Зробити var
const minSalary = 500;
const maxSalary = 500;
const employees = 5;
let totalSalary = 0; 

// 2. Перебрати праціваників в циклі

// 3. Згенерувати працівнику випадкову зарпплату 

// 4. дадати до totalSalary

// 5. висести в log
